chapter 1/ch01.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>FCS CHAPTER I</title>
<!-- 2018-08-16 Thu 13:09 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Chinmay.Bhoir" />
</head>
<body>
<div id="content">
<h1 class="title">FCS CHAPTER I</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Data Models</a>
<ul>
<li><a href="#sec-1-1">1.1. Two aspects of data model</a></li>
<li><a href="#sec-1-2">1.2. 'Data model' and 'data structure' are different</a></li>
<li><a href="#sec-1-3">1.3. Data models in programming</a></li>
<li><a href="#sec-1-4">1.4. Exercise</a></li>
</ul>
</li>
<li><a href="#sec-2">2. The C Data Model</a>
<ul>
<li><a href="#sec-2-1">2.1. The C Type System</a></li>
<li><a href="#sec-2-2">2.2. Exercise</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Algorithms and the Design of Programs</a>
<ul>
<li><a href="#sec-3-1">3.1. Software development process</a></li>
<li><a href="#sec-3-2">3.2. Programming style</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Notes on chapter 1 of "Foundations of Computer Science" by Alfred Aho and Jeffrey Ullman
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Data Models</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Two aspects of data model</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Value that an object can consume. This is usually the static part, also called as 'Type system'
</li>
<li>Operations on data. This is usually the dynamic part.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 'Data model' and 'data structure' are different</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Data model is an abstraction, while data structure is an implementation
</li>
<li>For example, 'list' is an abstraction (data model), while 'linked list' is an implementation (data structure).
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Data models in programming</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>The basic principle under which most programming languages deal with data is that each program has access to "boxes", which we can think of as regions of storage. Each box has a type, such as int or char. 
</li>
<li>We may store in a box any value of the correct type for that box. 
</li>
<li>We often refer to the values that can be stored in boxes as data objects
</li>
<li>In C, a list of integers can be represented by a data structure called a linked list in which list elements are stored in cells. 
</li>
<li>Lists and their cells can be defined by a type declaration such as
</li>
</ul>
<pre class="example">
typedef struct CELL *LIST;
struct CELL {
    int element;
    LIST next;;
}
</pre>

<ul class="org-ul">
<li>This declaration defines a self-referential structure CELL with two fields. The first is element, which holds the value of an element of the list and is of type int.
</li>
<li>The second field of each CELL is next, which holds a pointer to a cell. 
</li>
<li>Note that the type LIST is really a pointer to a CELL. Thus, structures of type CELL can be linked together by their next fields to form what we usually think of as a linked list
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Exercise</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Describe data model of your favourite text editor
</li>
<li>Describe data model of spreadsheet program
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> The C Data Model</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> The C Type System</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Static part of C data model, describes the types of values that data can have.
</li>
<li>Basic types in C:
<ul class="org-ul">
<li>Characters (char, signed char, unsigned char)
</li>
<li>Integers (int, short int, long int, unsigned)
</li>
<li>Floating-point numbers (float, double, long double)
</li>
<li>Enumerations (enum)
</li>
</ul>
</li>
<li>Type formation rules in C:
<ul class="org-ul">
<li><i>Array Types</i> : Array whose elements are type T is denoted by 
</li>
</ul>
</li>
</ul>
\begin{align*}
T &  A[n]
\end{align*}
<ul class="org-ul">
<li><i>Structure Types</i> : Structure is a grouping of variables called <i>members</i> or <i>fields</i>. 
</li>
</ul>
<pre class="example">
struct S {
    T1 M1 ;
    T2 M2 ;
    ···
    Tn Mn ;
}
</pre>
<ul class="org-ul">
<li><i>Union Types</i> : A union type allows a variable to have different types at different times during the execution of a program. 
</li>
</ul>
<p>
The declaration
</p>
<pre class="example">
union {
    T1 M1 ;
    T2 M2 ;
    ···
    Tn Mn ;
} x;
</pre>
<p>
defines a variable x that can hold a value of any of the types T1 , T2 , . . . , Tn .
</p>

<ul class="org-ul">
<li><i>Pointer Types</i> : A variable of type pointer contains the address of a region of storage. Following is the declaration of variable p to be a pointer to a variable of type T.
</li>
</ul>
\begin{align*}
T & *p;
\end{align*}
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Exercise</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Give an example of a C data object that has more than one name.
</li>
<li>If you are familiar with another programming language besides C, describe its type system and operations.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Algorithms and the Design of Programs</h2>
<div class="outline-text-2" id="text-3">
<p>
Data models, their properties, and their appropriate usage is one pillar of computer science. Other, equally important, pillar is algorithms and and their associated data structures.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Software development process</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Problem definition and specification
</li>
<li>Design
</li>
<li>Implementation
</li>
<li>Integration and system testing
</li>
<li>Installation and field testing
</li>
<li>Maintenance
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Programming style</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Modularize the program into coherent pieces
</li>
<li>Lay out the program so that its structure is clear
</li>
<li>Write intelligent comments to explain the program. Describe the data models, data structures used to represent them, and operations performed.
</li>
<li>Use meaningful names for procedures and variables
</li>
<li>Avoid explicit constants whenever possible.
</li>
<li>Avoid using global variables
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Chinmay.Bhoir</p>
<p class="date">Created: 2018-08-16 Thu 13:09</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
